// export const movies = [
//   { id: 1, title: 'Interstellar', genre: 'Sci-Fi',    year: 2014,
//     detail: 'การเดินทางข้ามกาแล็กซีเพื่อหาบ้านใหม่ให้มนุษยชาติ' },
//   { id: 2, title: 'Your Name',    genre: 'Animation', year: 2016,
//     detail: 'เด็กหนุ่มกับเด็กสาวที่สลับร่างกันข้ามเวลา' },
//   { id: 3, title: 'Parasite',     genre: 'Thriller',  year: 2019,
//     detail: 'ครอบครัวยากจนที่ค่อย ๆ แทรกซึมเข้าไปในบ้านคนรวย' },
// ];

// เธชเธฃเนเธฒเธเธญเธฑเธ•เนเธเธกเธฑเธ•เธดเธเธฒเธ TMDB เธ”เนเธงเธข make-data.mjs
// This product uses the TMDB API but is not endorsed or certified by TMDB.
export const movies = [
  {
    "id": 1,
    "tmdbId": 157336,
    "title": "Interstellar",
    "titleTh": "อินเตอร์สเตลลาร์ ทะยานดาวกู้โลก",
    "genre": "Adventure",
    "year": 2014,
    "rating": 8.5,
    "detail": "โลกในอนาคตกำลังจะล่มสลายจากภาวะอดอยากและพายุฝุ่น โจเซฟ คูเปอร์ อดีตวิศวกร และนักบินนาซา ต้องจำใจทิ้งลูกๆ ไปร่วมภารกิจลับ เดินทางข้ามรูหนอน (Wormhole) ไปยังกาแล็กซีอื่น เพื่อหาดาวเคราะห์ดวงใหม่ ที่มนุษยชาติจะย้ายไปอาศัยอยู่ได้",
    "poster": "https://image.tmdb.org/t/p/w342/yQvGrMoipbRoddT0ZR8tPoR7NfX.jpg"
  },
  {
    "id": 2,
    "tmdbId": 372058,
    "title": "Your Name.",
    "titleTh": "หลับตาฝัน ถึงชื่อเธอ",
    "genre": "Animation",
    "year": 2016,
    "rating": 8.5,
    "detail": "เรื่องราวของ ทาคิ เด็กหนุ่มมัธยมปลายในกรุงโตเกียว และ มิตสึฮะ เด็กสาวมัธยมปลายในเมืองชนบทท่ามกลางหุบเขา ทั้งสองคนไม่เคยรู้จักกันมาก่อน แต่จู่ๆ เกิดปรากฏการณ์ประหลาดที่ทำให้พวกเขา สลับร่างกัน ในตอนนอนหลับ ทั้งคู่จึงต้องเรียนรู้ชีวิตของกันและกัน และพยายามตามหากันและกันในโลกความจริง จนกระทั่งพวกเขาพบความจริงบางอย่างที่เชื่อมโยงกับดาวตกที่กำลังจะโคจรมาเยือนโลก",
    "poster": "https://image.tmdb.org/t/p/w342/vfJFJPepRKapMd5G2ro7klIRysq.jpg"
  },
  {
    "id": 3,
    "tmdbId": 496243,
    "title": "Parasite",
    "titleTh": "ชนชั้นปรสิต",
    "genre": "Thriller",
    "year": 2019,
    "rating": 8.5,
    "detail": "ภาพยนตร์ดราม่า-ตลกร้าย เสียดสีสังคมจากเกาหลีใต้ กำกับโดย บงจุนโฮ สร้างประวัติศาสตร์คว้ารางวัลภาพยนตร์ยอดเยี่ยม (Best Picture) จากเวทีออสการ์ เรื่องราวของครอบครัวยากจนที่ใช้กลอุบายแทรกซึมเข้าไปทำงานในบ้านของมหาเศรษฐี จนนำไปสู่เหตุการณ์ระทึกขวัญที่ไม่มีใครคาดคิด",
    "poster": "https://image.tmdb.org/t/p/w342/7IiTTgloJzvGI1TAYymCfbfl3vT.jpg"
  },
  {
    "id": 4,
    "tmdbId": 438631,
    "title": "Dune",
    "titleTh": " ดูน ",
    "genre": "Science Fiction",
    "year": 2021,
    "rating": 7.8,
    "detail": "มหากาพย์ภาพยนตร์ไซไฟบล็อกบัสเตอร์ ผลงานกำกับของ เดนิส วิลเนิฟ ดัดแปลงจากนิยายระดับตำนานของ แฟรงก์ เฮอร์เบิร์ต เล่าเรื่องราวของ พอล อะเทรดีส (รับบทโดย ทิโมธี ชาลาเมต์) ชายหนุ่มผู้มีพรสวรรค์ที่ต้องเดินทางไปยังดาวเคราะห์ที่อันตรายที่สุดในจักรวาลเพื่อปกป้องอนาคตของครอบครัวและประชาชนของเขา",
    "poster": "https://image.tmdb.org/t/p/w342/v1tRXZ4JtD2Iv6fjkPvT4GiwslV.jpg"
  },
  {
    "id": 5,
    "tmdbId": 533535,
    "title": "Deadpool & Wolverine",
    "titleTh": "เดดพูล & วูล์ฟเวอรีน",
    "genre": "Action",
    "year": 2024,
    "rating": 7.6,
    "detail": " ภาพยนตร์ซูเปอร์ฮีโร่สุดเกรียนเรต R จากค่าย Marvel Studios ที่พา 2 ตัวละครระดับไอคอนอย่าง เดดพูล (ไรอัน เรย์โนลด์ส) และ วูล์ฟเวอรีน (ฮิวจ์ แจ็คแมน) มาแท็กทีมกันเป็นครั้งแรกในจักรวาล MCU เพื่อปฏิบัติภารกิจกู้จักรวาลบ้านเกิดของเดดพูลที่กำลังจะล่มสลายจากภัยคุกคามในมัลติเวิร์ส",
    "poster": "https://image.tmdb.org/t/p/w342/8cdWjvZQUExUUTzyp4t6EDMubfO.jpg"
  },
  {
    "id": 6,
    "tmdbId": 83533,
    "title": "Avatar: Fire and Ash",
    "titleTh": " อวตาร: เถ้าถ่านและไฟ ",
    "genre": "Science Fiction",
    "year": 2025,
    "rating": 7.6,
    "detail": " ภาพยนตร์ภาคที่ 3 ในมหากาพย์ไซไฟของ เจมส์ คาเมรอน (เข้าฉายช่วงปลายปี 2025) เรื่องราวจะพาผู้ชมกลับไปยังดาวแพนโดราอีกครั้ง โดยในภาคนี้ เจค ซัลลี และเนย์ทีรี จะต้องเผชิญหน้ากับภัยคุกคามครั้งใหม่จากชนเผ่านาวีกลุ่มใหม่ที่ดุร้ายและกระหายอำนาจ นั่นคือ 'ชาวเถ้าถ่าน' (Ash People) ที่อาศัยอยู่แถบภูเขาไฟและได้ร่วมมือกับผู้รุกรานจากโลก",
    "poster": "https://image.tmdb.org/t/p/w342/bRBeSHfGHwkEpImlhxPmOcUsaeg.jpg"
  },
  {
    "id": 7,
    "tmdbId": 1228710,
    "title": "The Mandalorian and Grogu",
    "titleTh": "เดอะ แมนดาลอเรียน และ โกรกู",
    "genre": "Action",
    "year": 2026,
    "rating": 7.5,
    "detail": " ภาพยนตร์ฟอร์มยักษ์ขยายจักรวาล Star Wars (มีกำหนดฉายปี 2026) กำกับโดย จอน ฟาฟโร โดยเป็นการสานต่อเรื่องราวความสัมพันธ์และการผจญภัยสุดยิ่งใหญ่ในห้วงอวกาศของ ดิน จาริน (นักรบแมนดาลอเรียน) และ โกรกู (เบบี้โยดา) จากเวอร์ชันซีรีส์ยอดฮิตขึ้นสู่จอภาพยนตร์เป็นครั้งแรก",
    "poster": "https://image.tmdb.org/t/p/w342/cE9LAdexd9ju0yIkmCJBOKZg9JR.jpg"
  },
  {
    "id": 8,
    "tmdbId": 969681,
    "title": "Spider-Man: Brand New Day",
    "titleTh": "สไปเดอร์-แมน: แบรนด์นิวเดย์",
    "genre": "Science Fiction",
    "year": 2026,
    "rating": 7.9,
    "detail": " ภาพยนตร์เดี่ยวภาคที่ 4 ของสไปเดอร์แมน (ทอม ฮอลแลนด์) ในจักรวาล MCU (เข้าฉายปี 2026) เล่าเรื่องราว 4 ปีต่อจากเหตุการณ์ใน No Way Home เมื่อตัวตนของ ปีเตอร์ ปาร์คเกอร์ ถูกลบไปจากความทรงจำของทุกคน เขาต้องใช้ชีวิตวัยผู้ใหญ่เพียงลำพังและทำหน้าที่เป็นฮีโร่เต็มเวลา ทว่าแรงกดดันมหาศาลทำให้พลังของเขาเกิดการกลายพันธุ์ทางร่างกาย พร้อมกับการเผชิญหน้าวายร้ายตัวใหม่ที่ไม่มีใครมองเห็น",
    "poster": "https://image.tmdb.org/t/p/w342/bjiS5ipwxb9JFy3XRRN4OAilSeX.jpg"
  },
  {
    "id": 9,
    "tmdbId": 1368337,
    "title": "The Odyssey",
    "titleTh": "มหากาพย์โอดิสซี",
    "genre": "Adventure",
    "year": 2026,
    "rating": 8,
    "detail": "ภาพยนตร์แอ็กชันแฟนตาซีฟอร์มยักษ์ (เข้าฉายปี 2026) ผลงานกำกับและเขียนบทโดย คริสโตเฟอร์ โนแลน ดัดแปลงจากบทกวีมหากาพย์กรีกโบราณของโฮเมอร์ นำแสดงโดย แมตต์ เดมอน, ทอม ฮอลแลนด์ และ แอนน์ แฮททาเวย์ เล่าเรื่องราวการเดินทางฝ่าทะเลคลั่งอันยาวนานและเต็มไปด้วยอันตรายของ กษัตริย์โอดิสเซียส เพื่อเดินทางกลับบ้านหลังจบสงครามโทรจัน ซึ่งเขาต้องต่อสู้กับทั้งเทพเจ้าและสัตว์ประหลาดในตำนาน"
  },
  {
    "id": 10,
    "tmdbId": 1386315,
    "title": "The Runner",
    "titleTh": " เดอะ รันเนอร์ ",
    "genre": "Thriller",
    "year": 2026,
    "rating": 6.7,
    "detail": " ภาพยนตร์ทริลเลอร์จิตวิทยาซ่อนเงื่อน (เข้าฉายปี 2026 บน Prime Video) กำกับโดย เควิน แมคโดนัลด์ นำแสดงโดย กัล กาดอต รับบทเป็น มาเอีย มาร์เทน ทนายความหญิงผู้ทรงอิทธิพลในลอนดอน ที่จู่ๆ ได้รับสายปริศนาว่าลูกชายของเธอถูกลักพาตัวไป โดยมีข้อแม้สุดระทึกคือเธอต้องวิ่งไปตามคำสั่งของสายลึกลับนั้นทั่วเมืองลอนดอน ห้ามหยุด ห้ามบอกใคร ไม่งั้นลูกของเธอจะถูกฆ่า",
    "poster": "https://image.tmdb.org/t/p/w342/uxCaBoYXsDC4A0SqTm3SISj0OwK.jpg"
  }
];